In [6]:
import numpy as np
df=np.array([1,2,3,4])
df
df.ndim

1

In [3]:
df=np.array([[1],[2],[3],[4]])
df

array([[1],
       [2],
       [3],
       [4]])

In [5]:
df.ndim

2

In [10]:
df=np.array([[1,4,5],[2,3,4],[3,6,7]])
df

array([[1, 4, 5],
       [2, 3, 4],
       [3, 6, 7]])

In [19]:
import pandas as pd
df=np.array([[1,4,5],[2,3,4],[3,6,7]])
df1=pd.DataFrame(df)
df1

   0  1  2
0  1  4  5
1  2  3  4
2  3  6  7

In [46]:
df1.index=['A','B','C']
df1.columns=['a','b','c']
df1.columns[[0,1]]
df1

   a  b  c
A  1  4  5
B  2  3  4
C  3  6  7

In [41]:
s=df1[['a','b']].describe()
s

         a         b
count  3.0  3.000000
mean   2.0  4.333333
std    1.0  1.527525
min    1.0  3.000000
25%    1.5  3.500000
50%    2.0  4.000000
75%    2.5  5.000000
max    3.0  6.000000

In [51]:
w=df1[df1.columns[[0,1]]]
w

   a  b
A  1  4
B  2  3
C  3  6

In [57]:
e=df1.iloc[0:2,0:6]
e

   a  b  c
A  1  4  5
B  2  3  4

In [58]:
list(df1)

['a', 'b', 'c']

In [64]:
d1={'a':'v','b':'z'}
d1
df1.rename(columns=d1,inplace=True)

In [65]:
df1

   v  z  c
A  1  4  5
B  2  3  4
C  3  6  7

In [69]:
df1.drop(df1.index[1],axis=0)

   v  z  c
A  1  4  5
C  3  6  7